{"data":{"site":{"siteMetadata":{"title":"Becca Nelson Bailey"}},"allMarkdownRemark":{"edges":[{"node":{"excerpt":"This post is based on talks given at  RVA JavaScript Conf  and Chicago JS Camp. As a consultant, I have heard a lot about the pain points of…","fields":{"slug":"/javascript-survival-skills/"},"frontmatter":{"date":"December 28, 2018","title":"JavaScript Survival Skills","description":null}}},{"node":{"excerpt":"Selecting a state management tool for your team is critical to their success, and there are a lot of important factors to consider. 8th…","fields":{"slug":"/react-context-api/"},"frontmatter":{"date":"November 20, 2018","title":"A New Approach to State Management with the React Context API","description":"Selecting a state management tool for your team is critical to their success, and there are a lot of important factors to consider. 8th Light’s Becca Nelson shares her experience using React Context API to drive her team’s efficiency."}}},{"node":{"excerpt":"For front-end development using React, it’s important to pay attention to the architecture of your application. If you don’t organize your…","fields":{"slug":"/react-render-props/"},"frontmatter":{"date":"August 30, 2018","title":"Dependency Inversion in React with Render Props","description":"For front-end development using React, it's  important to pay attention to the architecture of your application. If you don’t organize your components well, you can create problems as your application grows. Learn how render props can simplify your state management and keep your code organized."}}},{"node":{"excerpt":"Recently, I had the pleasure of speaking with Jessi Chartier, who is the camp coordinator from App Camp for Girls in Chicago, which we will…","fields":{"slug":"/conversation-with-jessi-chartier/"},"frontmatter":{"date":"July 18, 2017","title":"A Conversation with Jessi Chartier from App Camp for Girls","description":null}}},{"node":{"excerpt":"When programming, it helps to tackle some of the more difficult aspects of software development by learning design patterns. Becca Nelson…","fields":{"slug":"/two-design-patterns/"},"frontmatter":{"date":"May 22, 2017","title":"Two Design Patterns You're Probably Already Using","description":"When programming, it helps to tackle some of the more difficult aspects of software development by learning design patterns. Becca Nelson, 8th Light Software Crafter, speaks to how to use these patterns on your path towards building better, and more maintainable, software solutions."}}}]}},"pageContext":{"isCreatedByStatefulCreatePages":true}}